## Pandas 3
**[1] Missing data handling**<br>
- Pandas missing values<br>
- Detect missing values<br>
- Drop missing values<br>
- Fill in missing values<br>

**[2] Calcualtion**<br>
- Basic operations<br>
- Data aggregation<br>

In [1]:
import pandas as pd

## [1] Missing data handling

### [1.1] Pandas values

- **Python None object**

In [2]:
x = None
type(x)

NoneType

- **Pandas NaN**

In [3]:
mySeries = pd.Series([1,2, None, 4])
mySeries

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [4]:
type(mySeries[2])

numpy.float64

- **Dataset with missing values**

In [5]:
fashion_df = pd.read_csv("../dataset/fashion.csv")  
fashion_df.head(10)

,Date,Amanda_Christensen,Calvin_Klein,Eton,J_Lindeberg,Lacoste,Levi_s,Oscar_Jacobson,Ray_Ban,Tiger_of_Sweden
0,2014-07-01,5744.00000,29976.0000,78835.127273,89833.846154,65226.40000,63884.8,18971.813333,NaN,287420.566400
1,2014-08-01,7372.80000,33969.0000,98835.054545,153530.892308,43368.68000,57153.6,48796.800000,NaN,322481.827200
2,2014-09-01,8881.00000,28602.0000,70640.000000,146138.461538,26553.20000,47048.0,37864.266667,NaN,263211.054400
3,2014-10-01,10693.21500,23257.0000,70230.181818,151481.846154,37045.60000,33032.0,23762.000000,NaN,295135.536000
4,2014-11-01,17121.80000,29817.0000,96073.745455,180756.000000,35666.80000,25476.0,41173.600000,NaN,328531.016000
5,2014-12-01,34321.60000,43738.5000,143256.363636,144416.615385,33796.40000,25960.8,47829.466667,NaN,519894.808000
6,2015-01-01,7085.20000,28526.5000,120765.818182,182552.492308,31064.80000,55235.2,30837.733333,NaN,300741.560000
7,2015-02-01,7233.60000,27148.4658,82245.672727,134998.584492,29403.62392,30020.8,21506.095840,19107.20000,270403.424000
8,2015-03-01,7635.20568,48290.5000,81373.939491,189940.558031,62399.68420,302.4,66656.124907,67636.40000,260036.051003
9,2015-04-01,8710.55292,30567.9132,80840.245018,136470.398400,73999.01736,NaN,52975.765947,57623.21312,200100.461966

- **Use info() to see the number of non-missing values in each columns**

In [6]:
fashion_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                51 non-null     object
 1   Amanda_Christensen  51 non-null     float64
 2   Calvin_Klein        51 non-null     float64
 3   Eton                51 non-null     float64
 4   J_Lindeberg         51 non-null     float64
 5   Lacoste             51 non-null     float64
 6   Levi_s              22 non-null     float64
 7   Oscar_Jacobson      51 non-null     float64
 8   Ray_Ban             44 non-null     float64
 9   Tiger_of_Sweden     51 non-null     float64
dtypes: float64(9), object(1)
memory usage: 4.1+ KB

### [1.2] Detect missing values

In [7]:
winery = ['Domaine Vincent Girardin',None,'Au Pied du Mont Chauve','Chateau Raymond-Lafon','Chateau Balac','Etienne de Tauriac','Borgogno','Sottimano','Punset','La Fiorita','Piccini','Pietranera']
country = ['France',None,'France','France','France','France','Italy','Italy',None,'Italy','Italy','Italy']
price = [94,None,43,120,45,25,80,58,43,60,None,75]
province = ['Burgundy',None,'Burgundy','Bordeaux','Bordeaux','Bordeaux','Piedmont','Piedmont',None,'Tuscany','Tuscany','Tuscany']
wine_df1 = pd.DataFrame({"winery":winery, "country":country, "price":price, "province":province})
wine_df1

                      winery country  price  province
0   Domaine Vincent Girardin  France   94.0  Burgundy
1                       None    None    NaN      None
2     Au Pied du Mont Chauve  France   43.0  Burgundy
3      Chateau Raymond-Lafon  France  120.0  Bordeaux
4              Chateau Balac  France   45.0  Bordeaux
5         Etienne de Tauriac  France   25.0  Bordeaux
6                   Borgogno   Italy   80.0  Piedmont
7                  Sottimano   Italy   58.0  Piedmont
8                     Punset    None   43.0      None
9                 La Fiorita   Italy   60.0   Tuscany
10                   Piccini   Italy    NaN   Tuscany
11                Pietranera   Italy   75.0   Tuscany

- **Use isna() to detect if the value is missing**

In [8]:
wine_df1.isna()

    winery  country  price  province
0    False    False  False     False
1     True     True   True      True
2    False    False  False     False
3    False    False  False     False
4    False    False  False     False
5    False    False  False     False
6    False    False  False     False
7    False    False  False     False
8    False     True  False      True
9    False    False  False     False
10   False    False   True     False
11   False    False  False     False

In [9]:
wine_df1.isna().sum()

winery      1
country     2
price       2
province    2
dtype: int64

In [10]:
wine_df1.notna().sum()

winery      11
country     10
price       10
province    10
dtype: int64

In [11]:
wine_df1.isna().sum(axis = 1)

0     0
1     4
2     0
3     0
4     0
5     0
6     0
7     0
8     2
9     0
10    1
11    0
dtype: int64

- **Use isna() to filter data**

In [12]:
wine_df1.price.isna()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
Name: price, dtype: bool

In [13]:
wine_df1[wine_df1.price.notna()]

                      winery country  price  province
0   Domaine Vincent Girardin  France   94.0  Burgundy
2     Au Pied du Mont Chauve  France   43.0  Burgundy
3      Chateau Raymond-Lafon  France  120.0  Bordeaux
4              Chateau Balac  France   45.0  Bordeaux
5         Etienne de Tauriac  France   25.0  Bordeaux
6                   Borgogno   Italy   80.0  Piedmont
7                  Sottimano   Italy   58.0  Piedmont
8                     Punset    None   43.0      None
9                 La Fiorita   Italy   60.0   Tuscany
11                Pietranera   Italy   75.0   Tuscany

### [1.3] Drop missing values

- **Drop rows containing any NaNs**

In [14]:
wine_df1.dropna()

                      winery country  price  province
0   Domaine Vincent Girardin  France   94.0  Burgundy
2     Au Pied du Mont Chauve  France   43.0  Burgundy
3      Chateau Raymond-Lafon  France  120.0  Bordeaux
4              Chateau Balac  France   45.0  Bordeaux
5         Etienne de Tauriac  France   25.0  Bordeaux
6                   Borgogno   Italy   80.0  Piedmont
7                  Sottimano   Italy   58.0  Piedmont
9                 La Fiorita   Italy   60.0   Tuscany
11                Pietranera   Italy   75.0   Tuscany

- **Drop rows that are all NaNs**

In [15]:
wine_df1.dropna(how = "all")

                      winery country  price  province
0   Domaine Vincent Girardin  France   94.0  Burgundy
2     Au Pied du Mont Chauve  France   43.0  Burgundy
3      Chateau Raymond-Lafon  France  120.0  Bordeaux
4              Chateau Balac  France   45.0  Bordeaux
5         Etienne de Tauriac  France   25.0  Bordeaux
6                   Borgogno   Italy   80.0  Piedmont
7                  Sottimano   Italy   58.0  Piedmont
8                     Punset    None   43.0      None
9                 La Fiorita   Italy   60.0   Tuscany
10                   Piccini   Italy    NaN   Tuscany
11                Pietranera   Italy   75.0   Tuscany

- **Drop rows that are all NaNs**

In [16]:
wine_df1.dropna(subset = ['country', 'province'], how = "all")

                      winery country  price  province
0   Domaine Vincent Girardin  France   94.0  Burgundy
2     Au Pied du Mont Chauve  France   43.0  Burgundy
3      Chateau Raymond-Lafon  France  120.0  Bordeaux
4              Chateau Balac  France   45.0  Bordeaux
5         Etienne de Tauriac  France   25.0  Bordeaux
6                   Borgogno   Italy   80.0  Piedmont
7                  Sottimano   Italy   58.0  Piedmont
9                 La Fiorita   Italy   60.0   Tuscany
10                   Piccini   Italy    NaN   Tuscany
11                Pietranera   Italy   75.0   Tuscany

- **Drop columns**

In [17]:
winery = ['Domaine Vincent Girardin','Domaine de Bellene','Au Pied du Mont Chauve','Chateau Raymond-Lafon','Chateau Balac','Etienne de Tauriac','Borgogno','Sottimano','Punset','La Fiorita','Piccini','Pietranera']
country = ['France','France','France',None,'France','France','Italy','Italy','Italy','Italy','Italy','Italy']
price = [94,60,43,120,45,25,80,58,43,60,60,75]
province = ['Burgundy','Burgundy','Burgundy','Bordeaux','Bordeaux','Bordeaux','Piedmont','Piedmont','Piedmont','Tuscany','Tuscany','Tuscany']
wine_df2 = pd.DataFrame({"winery":winery, "country":country, "price":price, "province":province, "description": None})
wine_df2

                      winery country  price  province description
0   Domaine Vincent Girardin  France     94  Burgundy        None
1         Domaine de Bellene  France     60  Burgundy        None
2     Au Pied du Mont Chauve  France     43  Burgundy        None
3      Chateau Raymond-Lafon    None    120  Bordeaux        None
4              Chateau Balac  France     45  Bordeaux        None
5         Etienne de Tauriac  France     25  Bordeaux        None
6                   Borgogno   Italy     80  Piedmont        None
7                  Sottimano   Italy     58  Piedmont        None
8                     Punset   Italy     43  Piedmont        None
9                 La Fiorita   Italy     60   Tuscany        None
10                   Piccini   Italy     60   Tuscany        None
11                Pietranera   Italy     75   Tuscany        None

- **Drop columns containing any NaNs**

In [18]:
wine_df2.dropna(axis = 1)

                      winery  price  province
0   Domaine Vincent Girardin     94  Burgundy
1         Domaine de Bellene     60  Burgundy
2     Au Pied du Mont Chauve     43  Burgundy
3      Chateau Raymond-Lafon    120  Bordeaux
4              Chateau Balac     45  Bordeaux
5         Etienne de Tauriac     25  Bordeaux
6                   Borgogno     80  Piedmont
7                  Sottimano     58  Piedmont
8                     Punset     43  Piedmont
9                 La Fiorita     60   Tuscany
10                   Piccini     60   Tuscany
11                Pietranera     75   Tuscany

### [1.4] Filling in missing values

In [19]:
sales_df = pd.DataFrame({"Month":["Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"],
                        "Sales":[266.0, 145.9, 183.1, None, 180.3, 168.5, 231.8, None, 192.8, 122.9, 203.4, 211.7]})
sales_df

   Month  Sales
0    Jan  266.0
1    Feb  145.9
2    Mar  183.1
3    Apr    NaN
4    May  180.3
5    Jun  168.5
6    Jul  231.8
7    Aug    NaN
8    Sep  192.8
9    Oct  122.9
10   Nov  203.4
11   Dec  211.7

In [20]:
sales_df

   Month  Sales
0    Jan  266.0
1    Feb  145.9
2    Mar  183.1
3    Apr    NaN
4    May  180.3
5    Jun  168.5
6    Jul  231.8
7    Aug    NaN
8    Sep  192.8
9    Oct  122.9
10   Nov  203.4
11   Dec  211.7

- **Replace missing values with a constant**

In [21]:
sales_df.fillna(0)

   Month  Sales
0    Jan  266.0
1    Feb  145.9
2    Mar  183.1
3    Apr    0.0
4    May  180.3
5    Jun  168.5
6    Jul  231.8
7    Aug    0.0
8    Sep  192.8
9    Oct  122.9
10   Nov  203.4
11   Dec  211.7

- **Replace missing values with the last valid observation**

In [22]:
sales_df.fillna(method = "ffill")

   Month  Sales
0    Jan  266.0
1    Feb  145.9
2    Mar  183.1
3    Apr  183.1
4    May  180.3
5    Jun  168.5
6    Jul  231.8
7    Aug  231.8
8    Sep  192.8
9    Oct  122.9
10   Nov  203.4
11   Dec  211.7

- **Replace missing values with the next valid observation**

In [23]:
sales_df.fillna(method = "bfill")

   Month  Sales
0    Jan  266.0
1    Feb  145.9
2    Mar  183.1
3    Apr  180.3
4    May  180.3
5    Jun  168.5
6    Jul  231.8
7    Aug  192.8
8    Sep  192.8
9    Oct  122.9
10   Nov  203.4
11   Dec  211.7

## Exercise.A

**(A.1) Import the dataset <code>melbourne.csv</code>. Calculate the number of rows and columns.**

In [24]:
house_df = pd.read_csv("../dataset/melbourne.csv")
house_df.shape

(13580, 21)

**(A.2) Delete the row containing any NaN. Calculate the number of rows and columns.**

In [25]:
house_df.dropna(how = "any").shape

(6196, 21)

**(A.3) Use the dataframe in (A.1). Calculate the number of missing value in each columns.**

In [26]:
house_df.isna().sum() #axis=0

Suburb              0
Address             0
Rooms               0
Type                0
Price               0
Method              0
SellerG             0
Date                0
Distance            0
Postcode            0
Bedroom2            0
Bathroom            0
Car                62
Landsize            0
BuildingArea     6450
YearBuilt        5375
CouncilArea      1369
Lattitude           0
Longtitude          0
Regionname          0
Propertycount       0
dtype: int64

**(A.4) What is the average number of parking space (column <code>Car</code>)?**

In [27]:
house_df.Car.mean()

1.6100754549489569

In [28]:
house_df["Car"].mean()

1.6100754549489569

**(A.5) Fill the missing values in the <code>Car</code> column with 0 and apply this change directly to the data frame. What is the average number of parking space?**<br>

In [29]:
house_df.Car.fillna(0, inplace = True)

In [30]:
house_df.isna().sum()

Suburb              0
Address             0
Rooms               0
Type                0
Price               0
Method              0
SellerG             0
Date                0
Distance            0
Postcode            0
Bedroom2            0
Bathroom            0
Car                 0
Landsize            0
BuildingArea     6450
YearBuilt        5375
CouncilArea      1369
Lattitude           0
Longtitude          0
Regionname          0
Propertycount       0
dtype: int64

In [31]:
house_df.Car.mean()

1.6027245949926363

## [2] Calculation

### [2.1] Basic operations

- **Series**

In [32]:
s1 = pd.Series([1,2,3,4,5])
print(s1.mean())
print(s1.sum())
print(s1.max())
print(s1.count())

3.0
15
5
5

In [33]:
s2 = pd.Series([1,2,3,4,None])
print(s2.mean())
print(s2.sum())
print(s2.max())
print(s2.count())

2.5
10.0
4.0
4

- **Calculate the sum of all the values over the column axis**

In [34]:
df_expense = pd.DataFrame({'grocery':[3050, 2800, 2750, 2300, 3150, 2900],
                         'transportation':[1050, 900, 1150, 1850, 1250, 950],
                         'dining out':[1200, 1950, 1350, 3250, 1050, 2800],
                         'entertainment':[1250, 1050, 2500, 3150, 2000, 1050]},
                        index =['Jan','Feb','Mar','Apr','May','Jun'])
df_expense

     grocery  transportation  dining out  entertainment
Jan     3050            1050        1200           1250
Feb     2800             900        1950           1050
Mar     2750            1150        1350           2500
Apr     2300            1850        3250           3150
May     3150            1250        1050           2000
Jun     2900             950        2800           1050

In [35]:
df_expense["total_expense"] = df_expense.sum(axis = 1)
df_expense

     grocery  transportation  dining out  entertainment  total_expense
Jan     3050            1050        1200           1250           6550
Feb     2800             900        1950           1050           6700
Mar     2750            1150        1350           2500           7750
Apr     2300            1850        3250           3150          10550
May     3150            1250        1050           2000           7450
Jun     2900             950        2800           1050           7700

- **Calculate the sum of the values of two columns**

In [36]:
df_expense['necessary_expense']  = df_expense.grocery + df_expense.transportation
df_expense

,grocery,transportation,dining out,entertainment,total_expense,necessary_expense
Jan,3050,1050,1200,1250,6550,4100
Feb,2800,900,1950,1050,6700,3700
Mar,2750,1150,1350,2500,7750,3900
Apr,2300,1850,3250,3150,10550,4150
May,3150,1250,1050,2000,7450,4400
Jun,2900,950,2800,1050,7700,3850

- **Calculate the percentage**

In [37]:
df_expense['necessary_expense(%)'] =  round((df_expense.necessary_expense/ df_expense.total_expense)*100,2)
df_expense

,grocery,transportation,dining out,entertainment,total_expense,necessary_expense,necessary_expense(%)
Jan,3050,1050,1200,1250,6550,4100,62.60
Feb,2800,900,1950,1050,6700,3700,55.22
Mar,2750,1150,1350,2500,7750,3900,50.32
Apr,2300,1850,3250,3150,10550,4150,39.34
May,3150,1250,1050,2000,7450,4400,59.06
Jun,2900,950,2800,1050,7700,3850,50.00

- **Convert continuous data to categorical data**

In [38]:
score_df = pd.DataFrame({"score":[75,60,40,100,85,55,65,20,70,0]})
score_df

   score
0     75
1     60
2     40
3    100
4     85
5     55
6     65
7     20
8     70
9      0

In [39]:
score_df["grade"] = pd.cut(score_df.score, bins = [0,34,44,54,64,74,100], 
                           labels = ["F","E","D","C","B","A"],
                           include_lowest= True)
score_df

   score grade
0     75     A
1     60     C
2     40     E
3    100     A
4     85     A
5     55     C
6     65     B
7     20     F
8     70     B
9      0     F

## Exercise.B

In [40]:
import random
random.seed(0)
product_df = pd.DataFrame({"Q1":[random.randint(100,150) for i in range(5)],"Q2":[random.randint(100,150) for i in range(5)],
                           "Q3":[random.randint(120,160) for i in range(5)],"Q4":[random.randint(120,160) for i in range(5)]}, index = ["A","B","C","D","E"])
product_df

    Q1   Q2   Q3   Q4
A  124  132  150  128
B  148  131  142  138
C  126  125  157  128
D  102  150  133  126
E  116  119  152  159

**(B.1) Given the synthetic dataset above, each column represents quarterly sales, and the index is the product name. Caculate the annual sales of each product.**

In [41]:
product_df["annual"] = product_df.sum(axis = 1)
product_df

    Q1   Q2   Q3   Q4  annual
A  124  132  150  128     534
B  148  131  142  138     559
C  126  125  157  128     536
D  102  150  133  126     511
E  116  119  152  159     546

**(B.2) Calculate the average quarterly sales for each product.**

In [42]:
product_df["Q_avg"] =  product_df.iloc[:,0:4].mean(axis = 1)
product_df

    Q1   Q2   Q3   Q4  annual   Q_avg
A  124  132  150  128     534  133.50
B  148  131  142  138     559  139.75
C  126  125  157  128     536  134.00
D  102  150  133  126     511  127.75
E  116  119  152  159     546  136.50

**(B.3) For each product, calculate the proportion of sales in the first half of the year to annual sales. Round the number to the two decimal place.**

In [43]:
# (Q1+Q2)/(Q1+Q2+Q3+Q4)
product_df["H1(%)"] = round((product_df.Q1 + product_df.Q2 )/product_df.annual*100,2)
product_df

    Q1   Q2   Q3   Q4  annual   Q_avg  H1(%)
A  124  132  150  128     534  133.50  47.94
B  148  131  142  138     559  139.75  49.91
C  126  125  157  128     536  134.00  46.83
D  102  150  133  126     511  127.75  49.32
E  116  119  152  159     546  136.50  43.04

**(B.4) For each product, calculate the percentage increase in sales in the second quarter compared to the first quarter.  Round the number to the two decimal place.**

In [44]:
# (Q2-Q1)/Q1
product_df["Q2-Q1(%)"] = round((product_df.Q2 - product_df.Q1 )/product_df.Q1*100,2)
product_df

    Q1   Q2   Q3   Q4  annual   Q_avg  H1(%)  Q2-Q1(%)
A  124  132  150  128     534  133.50  47.94      6.45
B  148  131  142  138     559  139.75  49.91    -11.49
C  126  125  157  128     536  134.00  46.83     -0.79
D  102  150  133  126     511  127.75  49.32     47.06
E  116  119  152  159     546  136.50  43.04      2.59

### [2.2] GroupBy

In [45]:
sales_df = pd.DataFrame({ "Product":["A","A","A","A","A","A","B","B","B","B","B","B"],
                           "Quarter":["Q1","Q1","Q1","Q2","Q2","Q2","Q1","Q1","Q1","Q2","Q2","Q2"],
                           "Month":["Jan","Feb","Mar","Apr","May","Jun","Jan","Feb","Mar","Apr","May","Jun"],
                           "Sales":[67, 57, 87, 50, 97, 68, 78, 102, 113, 98, 80, 84]})
sales_df

   Product Quarter Month  Sales
0        A      Q1   Jan     67
1        A      Q1   Feb     57
2        A      Q1   Mar     87
3        A      Q2   Apr     50
4        A      Q2   May     97
5        A      Q2   Jun     68
6        B      Q1   Jan     78
7        B      Q1   Feb    102
8        B      Q1   Mar    113
9        B      Q2   Apr     98
10       B      Q2   May     80
11       B      Q2   Jun     84

- **GroupBy based on one key**

In [46]:
sales_gb_product = sales_df.groupby("Product") 
type(sales_gb_product)

pandas.core.groupby.generic.DataFrameGroupBy

- **GroupBy obejct - attribute**

In [47]:
sales_gb_product.groups

{'A': [0, 1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10, 11]}

- **GroupBy obejct - methods**

In [48]:
sales_gb_product.size()

Product
A    6
B    6
dtype: int64

In [49]:
sales_gb_product.mean()

         Sales
Product
A         71.0
B         92.5

In [50]:
sales_gb_product.max()

        Quarter Month  Sales
Product
A            Q2   May     97
B            Q2   May    113

In [51]:
sales_gb_product.Sales.max()

Product
A     97
B    113
Name: Sales, dtype: int64

In [52]:
sales_gb_product.Sales.agg(['mean','min','max'])

         mean  min  max
Product
A        71.0   50   97
B        92.5   78  113

- **GroupBy based on two keys**

In [53]:
sales_gb_product_Q = sales_df.groupby(['Product','Quarter'])

In [54]:
sales_gb_product_Q.groups

{('A', 'Q1'): [0, 1, 2], ('A', 'Q2'): [3, 4, 5], ('B', 'Q1'): [6, 7, 8], ('B', 'Q2'): [9, 10, 11]}

In [55]:
sales_gb_product_Q.Sales.sum()

Product  Quarter
A        Q1         211
         Q2         215
B        Q1         293
         Q2         262
Name: Sales, dtype: int64

In [56]:
round(sales_gb_product_Q.Sales.mean(),2)

Product  Quarter
A        Q1         70.33
         Q2         71.67
B        Q1         97.67
         Q2         87.33
Name: Sales, dtype: float64

- **Convert Series to DataFrame**<br>

In [57]:
type(sales_gb_product_Q.Sales.sum())

pandas.core.series.Series

In [58]:
# Convert the series to dataframe with the column name Q_sales
quarterly_sales = sales_gb_product_Q.Sales.sum().to_frame(name = "Q_sales")
quarterly_sales

                 Q_sales
Product Quarter
A       Q1           211
        Q2           215
B       Q1           293
        Q2           262

In [59]:
# Multiple index
quarterly_sales.index

MultiIndex([('A', 'Q1'),
            ('A', 'Q2'),
            ('B', 'Q1'),
            ('B', 'Q2')],
           names=['Product', 'Quarter'])

In [60]:
# Add group keys to new columns
quarterly_sales.reset_index(inplace = True)
quarterly_sales

  Product Quarter  Q_sales
0       A      Q1      211
1       A      Q2      215
2       B      Q1      293
3       B      Q2      262

## Exercise.C

**(C.1) Given the following data, calculate the average price of wine in each province.**

In [61]:
winery = ['Domaine Vincent Girardin','Domaine de Bellene','Au Pied du Mont Chauve','Chateau Raymond-Lafon','Chateau Balac','Etienne de Tauriac','Borgogno','Sottimano','Punset','La Fiorita','Piccini','Pietranera']
country = ['France','France','France','France','France','France','Italy','Italy','Italy','Italy','Italy','Italy']
price = [94,60,43,120,45,25,80,58,43,60,60,75]
province = ['Burgundy','Burgundy','Burgundy','Bordeaux','Bordeaux','Bordeaux','Piedmont','Piedmont','Piedmont','Tuscany','Tuscany','Tuscany']
wine_df = pd.DataFrame({"winery":winery, "country":country, "price":price, "province":province})

In [63]:
wine_df

                      winery country  price  province
0   Domaine Vincent Girardin  France     94  Burgundy
1         Domaine de Bellene  France     60  Burgundy
2     Au Pied du Mont Chauve  France     43  Burgundy
3      Chateau Raymond-Lafon  France    120  Bordeaux
4              Chateau Balac  France     45  Bordeaux
5         Etienne de Tauriac  France     25  Bordeaux
6                   Borgogno   Italy     80  Piedmont
7                  Sottimano   Italy     58  Piedmont
8                     Punset   Italy     43  Piedmont
9                 La Fiorita   Italy     60   Tuscany
10                   Piccini   Italy     60   Tuscany
11                Pietranera   Italy     75   Tuscany

In [65]:
wine_df.groupby("province").mean()

              price
province
Bordeaux  63.333333
Burgundy  65.666667
Piedmont  60.333333
Tuscany   65.000000

**(C.2) Import the dataset <code>fashion.csv</code>. Remove the columns with missing values.**

In [67]:
fashion_df = pd.read_csv("../dataset/fashion.csv")
fashion_df.shape

(51, 10)

In [69]:
fashion_df.isnull().sum()

Date                   0
Amanda_Christensen     0
Calvin_Klein           0
Eton                   0
J_Lindeberg            0
Lacoste                0
Levi_s                29
Oscar_Jacobson         0
Ray_Ban                7
Tiger_of_Sweden        0
dtype: int64

In [71]:
fashion_df.dropna(axis=1, inplace= True)

In [73]:
fashion_df.shape

(51, 8)

**(C.3)  Extract the years from the column Date and put them in a new column named <code>Year</code>. Display the first 10 rows.**

In [77]:
fashion_df["Year"] = fashion_df.Date.str[0:4]
fashion_df.head(10)

,Date,Amanda_Christensen,Calvin_Klein,Eton,J_Lindeberg,Lacoste,Oscar_Jacobson,Tiger_of_Sweden,Year
0,2014-07-01,5744.00000,29976.0000,78835.127273,89833.846154,65226.40000,18971.813333,287420.566400,2014
1,2014-08-01,7372.80000,33969.0000,98835.054545,153530.892308,43368.68000,48796.800000,322481.827200,2014
2,2014-09-01,8881.00000,28602.0000,70640.000000,146138.461538,26553.20000,37864.266667,263211.054400,2014
3,2014-10-01,10693.21500,23257.0000,70230.181818,151481.846154,37045.60000,23762.000000,295135.536000,2014
4,2014-11-01,17121.80000,29817.0000,96073.745455,180756.000000,35666.80000,41173.600000,328531.016000,2014
5,2014-12-01,34321.60000,43738.5000,143256.363636,144416.615385,33796.40000,47829.466667,519894.808000,2014
6,2015-01-01,7085.20000,28526.5000,120765.818182,182552.492308,31064.80000,30837.733333,300741.560000,2015
7,2015-02-01,7233.60000,27148.4658,82245.672727,134998.584492,29403.62392,21506.095840,270403.424000,2015
8,2015-03-01,7635.20568,48290.5000,81373.939491,189940.558031,62399.68420,66656.124907,260036.051003,2015
9,2015-04-01,8710.55292,30567.9132,80840.245018,136470.398400,73999.01736,52975.765947,200100.461966,2015

**(C.4) Grouping data based on column <code>Year</code>.**

In [79]:
fashion_gb =  fashion_df.groupby("Year")
fashion_gb.groups

{'2014': [0, 1, 2, 3, 4, 5], '2015': [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], '2016': [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29], '2017': [30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41], '2018': [42, 43, 44, 45, 46, 47, 48, 49, 50]}

**(C.5) Calculate the total annual sales of each brand.**

In [80]:
fashion_gb.sum()

,Amanda_Christensen,Calvin_Klein,Eton,J_Lindeberg,Lacoste,Oscar_Jacobson,Tiger_of_Sweden
Year,,,,,,,
2014,84134.415000,1.893595e+05,5.578705e+05,8.661577e+05,2.416571e+05,2.183979e+05,2.016675e+06
2015,167430.129835,5.941004e+05,1.428274e+06,2.117095e+06,6.407895e+05,6.076360e+05,3.659951e+06
2016,191030.996260,1.058004e+06,1.864815e+06,2.952878e+06,8.809577e+05,8.366341e+05,3.477013e+06
2017,250064.914292,1.223611e+06,2.175278e+06,3.311648e+06,1.068541e+06,1.061889e+06,3.283573e+06
2018,155101.878409,1.227815e+06,1.659610e+06,1.881761e+06,1.010485e+06,8.733544e+05,1.999529e+06